Repository: littlebobert/sasu-internal
Catalog: AppBundle/Localization/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

source: Opened Accessibility settings. Enable Sasu, then relaunch Sasu.
ja: アクセシビリティ設定を開きました。Sasuを有効にしてから、Sasuを再起動してください。
zh_hans: 已打开辅助功能设置。请启用 Sasu，然后重新启动 Sasu。
zh_hant: 已開啟輔助使用設定。請啟用 Sasu，然後重新啟動 Sasu。

source: Opened Automation settings. Enable Safari under Sasu, then capture Safari again.
ja: オートメーション設定を開きました。Sasuの下にあるSafariを有効にしてから、もう一度Safariをキャプチャしてください。
zh_hans: 已打开自动化设置。请在 Sasu 下启用 Safari，然后再次捕捉 Safari。
zh_hant: 已開啟自動化設定。請在 Sasu 下啟用 Safari，然後再次擷取 Safari。

source: Opened Screen Recording settings. Enable Sasu, then relaunch Sasu.
ja: 画面収録設定を開きました。Sasuを有効にしてから、Sasuを再起動してください。
zh_hans: 已打开屏幕录制设置。请启用 Sasu，然后重新启动 Sasu。
zh_hant: 已開啟螢幕錄製設定。請啟用 Sasu，然後重新啟動 Sasu。

source: Privacy question about Sasu
ja: Sasuのプライバシーについての質問
zh_hans: 关于 Sasu 隐私的问题
zh_hant: 關於 Sasu 隱私權的問題

source: Question about Sasu
ja: Sasuについての質問
zh_hans: 关于 Sasu 的问题
zh_hant: 關於 Sasu 的問題

source: Quit this process and launch Sasu from Build/Sasu.app so macOS applies permission changes to the app bundle.
ja: このプロセスを終了し、Build/Sasu.appからSasuを起動して、macOSがアプリバンドルに許可の変更を適用できるようにしてください。
zh_hans: 请退出此进程并从 Build/Sasu.app 启动 Sasu，以便 macOS 将权限更改应用到 App 包。
zh_hant: 請結束此程序並從 Build/Sasu.app 啟動 Sasu，讓 macOS 將權限變更套用至 App 套件。

source: Reading Safari page...
ja: Safariページを読み取り中...
zh_hans: 正在读取 Safari 页面...
zh_hant: 正在讀取 Safari 頁面...

source: Reading visible selection...
ja: 画面上の選択範囲を読み取り中...
zh_hans: 正在读取屏幕上的所选内容...
zh_hant: 正在讀取畫面上的所選內容...

source: Reads %@ into %@. Editable selections translate in the reverse direction so you can replace text you are writing.
ja: %@を%@に翻訳します。編集可能な選択範囲は逆方向に翻訳されるため、入力中のテキストを置換できます。
zh_hans: 将 %@ 翻译为 %@。可编辑的所选内容会按相反方向翻译，以便替换您正在输入的文本。
zh_hant: 將 %@ 翻譯為 %@。可編輯的所選內容會以相反方向翻譯，以便取代您正在輸入的文字。

source: Ready. Use %@ for the command wheel.
ja: 準備完了。%@でコマンドホイールを開けます。
zh_hans: 已就绪。使用 %@ 打开命令轮盘。
zh_hant: 已就緒。使用 %@ 開啟指令轉盤。

source: Safari blocked page text extraction. In Safari, enable Safari > Develop > Developer Settings > Allow JavaScript from Apple Events, then capture again.
ja: Safariによってページテキストの抽出がブロックされました。Safariで「Safari」>「開発」>「デベロッパ設定」>「Apple EventsからのJavaScriptを許可」を有効にしてから、もう一度キャプチャしてください。
zh_hans: Safari 阻止了页面文本提取。请在 Safari 中启用“Safari”>“开发”>“开发者设置”>“允许来自 Apple 事件的 JavaScript”，然后再次捕捉。
zh_hant: Safari 阻止了頁面文字擷取。請在 Safari 中啟用「Safari」>「開發」>「開發者設定」>「允許來自 Apple 事件的 JavaScript」，然後再次擷取。

source: Safari may also require Safari > Develop > Developer Settings > Allow JavaScript from Apple Events.
ja: Safariで「Safari」>「開発」>「デベロッパ設定」>「Apple EventsからのJavaScriptを許可」を有効にする必要がある場合もあります。
zh_hans: Safari 可能还要求启用“Safari”>“开发”>“开发者设置”>“允许来自 Apple 事件的 JavaScript”。
zh_hant: Safari 可能還要求啟用「Safari」>「開發」>「開發者設定」>「允許來自 Apple 事件的 JavaScript」。

source: Safari page capture is off. You can turn it on in Settings.
ja: Safariページのキャプチャはオフです。設定でオンにできます。
zh_hans: Safari 页面捕捉已关闭。您可以在“设置”中将其打开。
zh_hant: Safari 頁面擷取已關閉。您可以在「設定」中將其開啟。

source: Safari page content was not included because Safari has no open window.
ja: Safariに開いているウインドウがないため、Safariページの内容は含まれませんでした。
zh_hans: 由于 Safari 没有打开的窗口，因此未包含 Safari 页面内容。
zh_hant: 由於 Safari 沒有開啟的視窗，因此未包含 Safari 頁面內容。

source: Safari page content was not included because macOS Automation permission was denied. Enable Sasu under System Settings > Privacy & Security > Automation, then try again.
ja: macOSのオートメーション許可が拒否されたため、Safariページの内容は含まれませんでした。「システム設定」>「プライバシーとセキュリティ」>「オートメーション」でSasuを有効にしてから、もう一度お試しください。
zh_hans: 由于 macOS 自动化权限被拒绝，因此未包含 Safari 页面内容。请在“系统设置”>“隐私与安全性”>“自动化”中启用 Sasu，然后重试。
zh_hant: 由於 macOS 自動化權限遭拒，因此未包含 Safari 頁面內容。請在「系統設定」>「隱私權與安全性」>「自動化」中啟用 Sasu，然後再試一次。

source: Safari page content was not included because the active tab did not expose readable text.
ja: アクティブなタブから読み取り可能なテキストを取得できなかったため、Safariページの内容は含まれませんでした。
zh_hans: 由于当前标签页未提供可读文本，因此未包含 Safari 页面内容。
zh_hant: 由於目前分頁未提供可讀文字，因此未包含 Safari 頁面內容。

source: Safari returned an unexpected response while Sasu was reading the page.
ja: Sasuがページを読み取っている間に、Safariから予期しない応答が返されました。
zh_hans: Sasu 读取页面时，Safari 返回了意外响应。
zh_hant: Sasu 讀取頁面時，Safari 傳回了未預期的回應。

source: Sasu can give guidance based on the full Safari page, not just what’s visible. When you capture Safari, Sasu can include the active tab title, URL, and page text with your screenshot. It only reads Safari page content when you capture, and sends it with your question. macOS may ask whether Sasu can control Safari. Safari may also require Safari > Develop > Developer Settings > Allow JavaScript from Apple Events.
ja: Sasuは、表示中の範囲だけでなく、Safariページ全体に基づいて案内できます。 Safariをキャプチャすると、Sasuはアクティブなタブのタイトル、URL、ページテキストをスクリーンショットに含めることができます。Safariページの内容はキャプチャ時にのみ読み取り、質問と一緒に送信します。 macOSからSasuによるSafariの制御を許可するか確認される場合があります。また、Safariで「Safari」>「開発」>「デベロッパ設定」>「Apple EventsからのJavaScriptを許可」を有効にする必要がある場合もあります。
zh_hans: Sasu 可以根据完整的 Safari 页面提供指引，而不仅限于屏幕上可见的内容。 捕捉 Safari 时，Sasu 可以在截屏中包含当前标签页的标题、URL 和页面文本。它只会在您捕捉时读取 Safari 页面内容，并将其与您的问题一起发送。 macOS 可能会询问是否允许 Sasu 控制 Safari。Safari 可能还要求启用“Safari”>“开发”>“开发者设置”>“允许来自 Apple 事件的 JavaScript”。
zh_hant: Sasu 可以根據完整的 Safari 頁面提供指引，而不僅限於畫面上可見的內容。 擷取 Safari 時，Sasu 可以在截圖中包含目前分頁的標題、URL 和頁面文字。它只會在您擷取時讀取 Safari 頁面內容，並將其與您的問題一起傳送。 macOS 可能會詢問是否允許 Sasu 控制 Safari。Safari 可能還要求啟用「Safari」>「開發」>「開發者設定」>「允許來自 Apple 事件的 JavaScript」。

source: Sasu captured the display but could not encode the screenshot.
ja: 画面はキャプチャできましたが、スクリーンショットをエンコードできませんでした。
zh_hans: Sasu 已捕捉显示器，但无法编码截屏。
zh_hant: Sasu 已擷取顯示器，但無法編碼截圖。

source: Sasu captures your screen only when you choose Capture & Ask or Capture Screen, then sends that screenshot to OpenAI with your question. macOS requires Screen Recording permission before Sasu can see the page or app you want help with.
ja: Sasuは「キャプチャして質問」または「画面をキャプチャ」を選択したときにのみ画面をキャプチャし、そのスクリーンショットを質問と一緒にOpenAIへ送信します。 Sasuが支援対象のページやアプリを確認するには、macOSの画面収録の許可が必要です。
zh_hans: Sasu 只会在您选择“捕捉并提问”或“捕捉屏幕”时捕捉屏幕，然后将该截屏与您的问题一起发送给 OpenAI。 Sasu 需要获得 macOS 屏幕录制权限，才能查看您需要帮助的页面或 App。
zh_hant: Sasu 只會在您選擇「擷取並提問」或「擷取螢幕」時擷取螢幕，然後將該截圖與您的問題一起傳送給 OpenAI。 Sasu 需要取得 macOS 螢幕錄製權限，才能查看您需要協助的頁面或 App。

source: Sasu could not read OpenAI's response: %@.%@
ja: SasuはOpenAIの応答を読み取れませんでした：%@。%@
zh_hans: Sasu 无法读取 OpenAI 的响应：%@。%@
zh_hant: Sasu 無法讀取 OpenAI 的回應：%@。%@

source: Sasu could not read the invite server response: %@.
ja: Sasuは招待サーバーの応答を読み取れませんでした：%@。
zh_hans: Sasu 无法读取邀请服务器响应：%@。
zh_hant: Sasu 無法讀取邀請伺服器回應：%@。

source: Sasu reads %@ into %@, and translates editable text in the reverse direction. You can change this later in Settings.
ja: Sasuは%@を%@に翻訳し、編集可能なテキストは逆方向に翻訳します。この設定は後で変更できます。
zh_hans: Sasu 将 %@ 翻译为 %@，并按相反方向翻译可编辑文本。您稍后可在“设置”中更改。
zh_hant: Sasu 將 %@ 翻譯為 %@，並以相反方向翻譯可編輯文字。您稍後可在「設定」中更改。

source: Sasu still cannot capture the screen. If Screen Recording is already enabled for Sasu, relaunch Sasu so macOS applies the new permission.
ja: Sasuはまだ画面をキャプチャできません。Sasuの画面収録がすでに有効な場合は、macOSが新しい許可を適用できるようSasuを再起動してください。
zh_hans: Sasu 仍无法捕捉屏幕。如果已为 Sasu 启用屏幕录制，请重新启动 Sasu，以便 macOS 应用新权限。
zh_hant: Sasu 仍無法擷取螢幕。如果已為 Sasu 啟用螢幕錄製，請重新啟動 Sasu，讓 macOS 套用新權限。

source: Sasu's invite server returned HTTP %lld: %@
ja: Sasuの招待サーバーからHTTP %lldが返されました：%@
zh_hans: Sasu 邀请服务器返回了 HTTP %lld：%@
zh_hant: Sasu 邀請伺服器傳回了 HTTP %lld：%@

source: Sasu's invite server returned an invalid response.
ja: Sasuの招待サーバーから無効な応答が返されました。
zh_hans: Sasu 邀请服务器返回了无效响应。
zh_hant: Sasu 邀請伺服器傳回了無效回應。

source: Screen Recording is enabled in System Settings, but Sasu needs one more relaunch before capture works.
ja: システム設定で画面収録は有効になっていますが、キャプチャを使用するにはSasuをもう一度再起動する必要があります。
zh_hans: 已在“系统设置”中启用屏幕录制，但还需重新启动一次 Sasu，捕捉功能才能正常使用。
zh_hant: 已在「系統設定」中啟用螢幕錄製，但還需重新啟動一次 Sasu，擷取功能才能正常使用。

source: Screenshot and Safari page ready. Type your question and press Send.
ja: スクリーンショットとSafariページの準備ができました。質問を入力して「送信」を押してください。
zh_hans: 截屏和 Safari 页面已就绪。请输入问题并按“发送”。
zh_hant: 截圖和 Safari 頁面已就緒。請輸入問題並按「傳送」。

source: Screenshot ready, but Safari page content was not included.
ja: スクリーンショットの準備ができましたが、Safariページの内容は含まれていません。
zh_hans: 截屏已就绪，但未包含 Safari 页面内容。
zh_hant: 截圖已就緒，但未包含 Safari 頁面內容。

source: Screenshot ready. Type your question and press Send.
ja: スクリーンショットの準備ができました。質問を入力して「送信」を押してください。
zh_hans: 截屏已就绪。请输入问题并按“发送”。
zh_hant: 截圖已就緒。請輸入問題並按「傳送」。

source: Select text in an editable field, then use this command to translate it in the reverse direction and replace it in place. This requires Accessibility permission.
ja: 編集可能なフィールドでテキストを選択し、このコマンドを使って逆方向に翻訳してその場で置換します。アクセシビリティの許可が必要です。
zh_hans: 在可编辑字段中选择文本，然后使用此命令按相反方向翻译并原位替换。此功能需要辅助功能权限。
zh_hant: 在可編輯欄位中選取文字，然後使用此指令以相反方向翻譯並原位取代。此功能需要輔助使用權限。

source: Sending follow-up...
ja: 追加の質問を送信中...
zh_hans: 正在发送后续问题...
zh_hant: 正在傳送後續問題...

source: The clipboard text is empty. Copy the text you want translated, then press Translate Clipboard.
ja: クリップボードのテキストが空です。翻訳するテキストをコピーしてから「クリップボードを翻訳」を押してください。
zh_hans: 剪贴板文本为空。请复制要翻译的文本，然后按“翻译剪贴板”。
zh_hant: 剪貼簿文字是空的。請複製要翻譯的文字，然後按「翻譯剪貼簿」。

source: This invite link is invalid, expired, or has already been used.
ja: この招待リンクは無効か、有効期限が切れているか、すでに使用されています。
zh_hans: 此邀请链接无效、已过期或已被使用。
zh_hant: 此邀請連結無效、已過期或已被使用。

source: This page contains %lld characters. Including it may make the response slower. Do you want to include it?
ja: このページには%lld文字あります。含めると応答が遅くなる場合があります。 含めますか？
zh_hans: 此页面包含 %lld 个字符。包含页面内容可能会使响应变慢。 是否要包含？
zh_hant: 此頁面包含 %lld 個字元。包含頁面內容可能會使回應變慢。 是否要包含？

source: Translate & Replace copies selected text from the app you are editing, translates it into your chosen language, and replaces the selection in place. macOS requires Accessibility permission so Sasu can send Copy and Paste commands. Sasu uses this access only when you choose Translate Selection or Translate & Replace. Translate Selection can still fall back to a screenshot if you do not grant access.
ja: 「翻訳して置換」は、編集中のアプリから選択したテキストをコピーし、選択した言語に翻訳して、その場で置換します。 Sasuがコピーとペーストのコマンドを送信するには、macOSのアクセシビリティの許可が必要です。Sasuは「選択範囲を翻訳」または「翻訳して置換」を選択したときにのみ、このアクセスを使用します。アクセスを許可しない場合でも、「選択範囲を翻訳」はスクリーンショットを使用できます。
zh_hans: “翻译并替换”会从您正在编辑的 App 中复制所选文本，将其翻译为您选择的语言，并原位替换所选内容。 macOS 要求授予辅助功能权限，Sasu 才能发送复制和粘贴命令。Sasu 只会在您选择“翻译所选内容”或“翻译并替换”时使用此权限。如果您不授予权限，“翻译所选内容”仍可改用截屏。
zh_hant: 「翻譯並取代」會從您正在編輯的 App 中複製所選文字，將其翻譯為您選擇的語言，並原位取代所選內容。 macOS 要求授予輔助使用權限，Sasu 才能傳送複製和貼上指令。Sasu 只會在您選擇「翻譯所選內容」或「翻譯並取代」時使用此權限。如果您不授予權限，「翻譯所選內容」仍可改用截圖。

source: When Safari is frontmost, Sasu can include the active tab title, URL, and page text with your screenshot so it can explain the whole page. macOS may ask for Automation permission the first time.
ja: Safariが最前面にあるとき、Sasuはアクティブなタブのタイトル、URL、ページテキストをスクリーンショットに含め、ページ全体を説明できます。初回はmacOSからオートメーションの許可を求められる場合があります。
zh_hans: 当 Safari 位于最前方时，Sasu 可以在截屏中包含当前标签页的标题、URL 和页面文本，以便说明整个页面。首次使用时，macOS 可能会请求自动化权限。
zh_hant: 當 Safari 位於最前方時，Sasu 可以在截圖中包含目前分頁的標題、URL 和頁面文字，以便說明整個頁面。首次使用時，macOS 可能會要求自動化權限。

source: When you’re ready, click the Japanese button. Then Sasu will ask macOS for Screen Recording permission.
ja: 準備ができたら、日本語のボタンをクリックしてください。その後、SasuがmacOSに画面収録の許可を求めます。
zh_hans: 准备好后，请点击日语按钮。然后 Sasu 会向 macOS 请求屏幕录制权限。
zh_hant: 準備好後，請按一下日文按鈕。然後 Sasu 會向 macOS 要求螢幕錄製權限。

source: With Accessibility permission, Translate Selection can copy highlighted text directly instead of taking a screenshot. This makes translations faster and avoids sending a screenshot. Accessibility also enables Translate & Replace, which can replace editable selections in place. Sasu uses this access only when you choose one of those commands.
ja: アクセシビリティを許可すると、「選択範囲を翻訳」はスクリーンショットを撮影せず、ハイライトされたテキストを直接コピーできます。翻訳が速くなり、スクリーンショットを送信せずに済みます。 アクセシビリティを許可すると、編集可能な選択範囲をその場で置換できる「翻訳して置換」も使用できます。Sasuは、これらのコマンドのいずれかを選択したときにのみ、このアクセスを使用します。
zh_hans: 授予辅助功能权限后，“翻译所选内容”可以直接复制高亮文本，而无需截屏。这样翻译速度更快，也可避免发送截屏。 辅助功能权限还会启用“翻译并替换”，可原位替换可编辑的所选内容。Sasu 只会在您选择其中一个命令时使用此权限。
zh_hant: 授予輔助使用權限後，「翻譯所選內容」可以直接複製反白文字，而無需截圖。這樣翻譯速度更快，也可避免傳送截圖。 輔助使用權限還會啟用「翻譯並取代」，可原位取代可編輯的所選內容。Sasu 只會在您選擇其中一個指令時使用此權限。

source: You chose not to include the %lld-character Safari page context.
ja: %lld文字のSafariページの内容を含めないことを選択しました。
zh_hans: 您选择不包含这段 %lld 字符的 Safari 页面上下文。
zh_hant: 您選擇不包含這段 %lld 字元的 Safari 頁面內容。

source: This is a welcome message for Sasu. It says Sasu helps explain Japanese pages and forms, then points to the next place to click. The green button means “Start using Sasu.”
ja: これはSasuのウェルカムメッセージです。Sasuが日本語のページやフォームを説明し、次にクリックする場所を示すと書かれています。緑色のボタンは「Sasuを始める」という意味です。
zh_hans: 这是 Sasu 的欢迎信息。它说明 Sasu 会帮助解释日语页面和表单，并指出下一步要点击的位置。绿色按钮表示“开始使用 Sasu”。
zh_hant: 這是 Sasu 的歡迎訊息。它說明 Sasu 會協助解釋日文頁面和表單，並指出下一步要點按的位置。綠色按鈕表示「開始使用 Sasu」。

source: Sasu included extracted Safari page text from below the visible viewport.
ja: Sasuは、表示範囲より下にあるSafariページのテキストも抽出して含めました。
zh_hans: Sasu 已包含从可见区域下方提取的 Safari 页面文本。
zh_hant: Sasu 已包含從可見區域下方擷取的 Safari 頁面文字。

source: Response body: %@
ja: 応答本文：%@
zh_hans: 响应正文：%@
zh_hant: 回應本文：%@

source: %lld pt
zh_hans: %lld 磅
zh_hant: %lld 點

source: Return
zh_hans: 回车

source: 日本語のサンプル
zh_hans: 日语示例
zh_hant: 日文範例

source: Sasuへようこそ。
zh_hans: 欢迎使用 Sasu。
zh_hant: 歡迎使用 Sasu。

source: 日本語のページやフォームで迷ったとき、Sasuが画面上で意味と次に押す場所を案内します。
zh_hans: 当您在日语页面或表单中遇到困难时，Sasu 会在屏幕上说明含义并指引下一步点击的位置。
zh_hant: 當您在日文頁面或表單中遇到困難時，Sasu 會在畫面上說明含義並指引下一步點按的位置。

source: Sasuを始める
zh_hans: 开始使用 Sasu
zh_hant: 開始使用 Sasu
